In [79]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

df = pd.DataFrame(
    {
        "foo": ["one", "one", "one", "two", "two", "two"],
        "bar": ["A", "B", "C", "A", "B", "C"],
        "baz": [1, 2, 3, 4, 5, 6],
        "qux": [6, 5, 4, 3, 2, 1],
        'quux': ['a', 'b', 'b', 'c', 'c', 'c']
    }
)

In [80]:
# hide
df

   foo bar  baz  qux quux
0  one   A    1    6    a
1  one   B    2    5    b
2  one   C    3    4    b
3  two   A    4    3    c
4  two   B    5    2    c
5  two   C    6    1    c

In [81]:
# hide
df.groupby('foo').groups

{'one': [0, 1, 2], 'two': [3, 4, 5]}

In [82]:
# hide
grouped = df.groupby('foo')
for name,group in grouped:
    print(name)
    print(group)

one
   foo bar  baz  qux quux
0  one   A    1    6    a
1  one   B    2    5    b
2  one   C    3    4    b
two
   foo bar  baz  qux quux
3  two   A    4    3    c
4  two   B    5    2    c
5  two   C    6    1    c

In [83]:
# hide
grouped.get_group('one')

   foo bar  baz  qux quux
0  one   A    1    6    a
1  one   B    2    5    b
2  one   C    3    4    b

In [84]:
grouped.describe()

      baz                                      qux                           \
    count mean  std  min  25%  50%  75%  max count mean  std  min  25%  50%
foo
one   3.0  2.0  1.0  1.0  1.5  2.0  2.5  3.0   3.0  5.0  1.0  4.0  4.5  5.0
two   3.0  5.0  1.0  4.0  4.5  5.0  5.5  6.0   3.0  2.0  1.0  1.0  1.5  2.0


     75%  max
foo
one  5.5  6.0
two  2.5  3.0

In [85]:
grouped.sum()

     baz  qux
foo
one    6   15
two   15    6

Apply multiple functions at once.

In [86]:
grouped['baz'].agg(['count', 'sum', 'mean', 'min', 'max'])

     count  sum  mean  min  max
foo
one      3    6     2    1    3
two      3   15     5    4    6

Apply different aggregation to the columns of a dataframe.

In [87]:
grouped.agg({'baz': 'sum', 'qux': 'sum'})

     baz  qux
foo
one    6   15
two   15    6